#+title: Notes

*** Examples
- Hello World
  #+begin_src C :results output
  #include <stdio.h>

  int main(){
      printf("Hello World!\n");
      return 0;
  }
  #+end_src

  #+begin_src C :includes <stdio.h> :results output
  int main() {
      printf("Hello, World!\n");
      return 0;
  }
  #+end_src

  #+begin_src C++ :includes '(<iostream> <stdio.h>) :results output
    std::cout<<"Hello World!\n";
    printf("%d\n", 2+2);
  #+end_src

- Types
  - Every variable has an associated data type that defines its data storage format. Each type requires a certain amount of memory and permits a relevant set of operations.

    #+begin_src C :results output
  #include <stdbool.h> //for bool

  int main(){
      int a;          // Integer
      unsigned int b; // Unsigned integers only store positive numbers. As a result, they have a higher positive range.
      char c;         // Character
      short d;        // Short integer
      long e;         // Long integer
      float f;        // Floating point integer
      double g;       //
      bool h;         // Boolean TRUE or FALSE
      return 0;
  }
    #+end_src

- Threads

    #+begin_src C :results output
#include <stdio.h>
#include <pthread.h>

void* thread_func(void* arg){
    printf("Printing from Thread\n");
    return NULL;
}

int main() {
    pthread_t thread_id;
    pthread_create(&thread_id, NULL, thread_func, NULL);
    pthread_join(thread_id, NULL); // Wait for thread to return before continuing execution
    printf("Thread returned\n");
    return 0;
}
    #+end_src

    #+RESULTS:
    : Printing from Thread
    : Thread returned
